In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['Josh', 'Jayshil', 'Pravin', 'Aakash', 'Krenil'],
    "marks":[80, 85, 82, 75, 70],
    "state":['Gujarat','Rajasthan','Tamilnadu', 'Rajasthan', 'Gujarat'] #created a dictionary.
}

In [3]:
df = pd.DataFrame(dict1)    #crated a dataframe with arranged data.

In [4]:
df

      name  marks      state
0     Josh     80    Gujarat
1  Jayshil     85  Rajasthan
2   Pravin     82  Tamilnadu
3   Aakash     75  Rajasthan
4   Krenil     70    Gujarat

In [5]:
df.to_csv('friends.csv')    #crated a csv file and addded data to it.

In [6]:
df.to_csv('friends_indexfalse.csv', index=False)    #created another csv but with no index.

In [7]:
df.head(3)  #first three rows.

      name  marks      state
0     Josh     80    Gujarat
1  Jayshil     85  Rajasthan
2   Pravin     82  Tamilnadu

In [8]:
df.tail(2)  #last two rows.

     name  marks      state
3  Aakash     75  Rajasthan
4  Krenil     70    Gujarat

In [9]:
df.describe()   #analysis the numerical component of dataframe.

          marks
count   5.00000
mean   78.40000
std     5.94138
min    70.00000
25%    75.00000
50%    80.00000
75%    82.00000
max    85.00000

In [10]:
df['marks'] #pulling up the 'marks' column

0    80
1    85
2    82
3    75
4    70
Name: marks, dtype: int64

In [11]:
df['marks'][2]  #pulling out the 3rd component of 'marks' column

82

In [12]:
df['marks'][2] = 80 #changing the very same component's value

C:\Users\joshr\AppData\Local\Temp\ipykernel_15264\336181118.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['marks'][2] = 80 #changing the very same component's value

In [13]:
df  #printed dataframe

      name  marks      state
0     Josh     80    Gujarat
1  Jayshil     85  Rajasthan
2   Pravin     80  Tamilnadu
3   Aakash     75  Rajasthan
4   Krenil     70    Gujarat

In [14]:
df.to_csv('friends.csv')    #pushed the modified data frme to csv file.

In [15]:
df.index = ['A', 'B', 'C', 'D', 'E']    #changed the indexes of dataframe.

In [16]:
df

      name  marks      state
A     Josh     80    Gujarat
B  Jayshil     85  Rajasthan
C   Pravin     80  Tamilnadu
D   Aakash     75  Rajasthan
E   Krenil     70    Gujarat

In [17]:
df.to_csv('friends.csv')    #exported the dtaframe to csv file.

In [18]:
josh = pd.read_csv('friends.csv')   #assigned the csv file to "josh".

In [19]:
josh

  Unnamed: 0     name  marks      state
0          A     Josh     80    Gujarat
1          B  Jayshil     85  Rajasthan
2          C   Pravin     80  Tamilnadu
3          D   Aakash     75  Rajasthan
4          E   Krenil     70    Gujarat

In [20]:
df

      name  marks      state
A     Josh     80    Gujarat
B  Jayshil     85  Rajasthan
C   Pravin     80  Tamilnadu
D   Aakash     75  Rajasthan
E   Krenil     70    Gujarat

In [21]:
df.to_csv('friends_indexfalse.csv', index = False)

In [24]:
ser = pd.Series(np.random.rand(10)) #building a series with random float.

In [25]:
ser

0    0.040758
1    0.342711
2    0.536793
3    0.986445
4    0.003658
5    0.319305
6    0.514730
7    0.319650
8    0.472925
9    0.809303
dtype: float64

In [27]:
type(ser)   #checking the type of ser.

pandas.core.series.Series

In [28]:
Ndf = pd.DataFrame(np.random.rand(350,6)) #created a new dataframe having random 350 rows and 6 columns.

In [29]:
Ndf #printed the dataframe

            0         1         2         3         4         5
0    0.178585  0.081850  0.254278  0.863654  0.768980  0.406658
1    0.959835  0.409766  0.719114  0.537985  0.785723  0.247890
2    0.258287  0.535801  0.084814  0.797021  0.878822  0.667085
3    0.046411  0.098858  0.077634  0.155568  0.678402  0.346367
4    0.275668  0.087375  0.471219  0.918704  0.180599  0.248473
..        ...       ...       ...       ...       ...       ...
345  0.890603  0.492993  0.535713  0.124912  0.702975  0.241142
346  0.629322  0.874050  0.950611  0.719803  0.721066  0.213682
347  0.596910  0.092549  0.718722  0.955543  0.394966  0.190255
348  0.794604  0.675985  0.667306  0.248113  0.339453  0.384355
349  0.214644  0.886212  0.768516  0.596664  0.460023  0.898673

[350 rows x 6 columns]